Repository: xbmc/screensaver.biogenesis
Catalog: screensaver.biogenesis/resources/language/resource.language.*/strings.po
Languages: de_de, it_it, zh_cn

# Addon Summary
source: BioGenesis screensaver
de_de: Bildschirmschoner BioGenesis
it_it: Salvaschermo BioGenesis
zh_cn: 生物发生屏保程序

# Addon Description
source: An implementation of John Conway's famous "Game of Life" with 3 custom coloring rules. A few basic rules govern which cells will live in the next generation depending on the cells current state and the number of its live neighbors.[CR][CR]Screenshots don't do this much justice as the motion of the system bordering between stability and chaos is what looks interesting.[CR][CR]Features:[CR] - 3 custom coloring rules are implemented each yielding interesting results.[CR] - Colony coloring color cells depending on the color of its 'parent' cells.[CR] - Lifetime coloring colors a cell depending on how long its been alive.[CR] - Neighbor coloring a cell depending on the configuration of its neighbors.[CR] - Many parameters are configurable in the settings.
de_de: Eine Implementierung von John Conways berühmtem „Spiel des Lebens“ mit 3 benutzerdefinierten Färbungsregeln. Einige grundlegende Regeln bestimmen, welche Zellen in der nächsten Generation leben werden, abhängig vom aktuellen Zustand der Zelle und der Anzahl ihrer lebenden Nachbarn.[CR][CR]Bildschirmfotos können dem nicht gerecht werden, da die Bewegung des Systems zwischen Stabilität und Chaos, interessant aussieht.[CR][CR]Eigenschaften:[CR] - Es werden jeweils 3 benutzerdefinierte Färbungsregeln implementiert, die jeweils interessante Ergebnisse liefern.[CR] - Die Färbung von Koloniezellen hängt von der Farbe ihrer „Elternzellen“ ab.[CR] - Die Lebenszeitfärbung färbt die Zelle in Abhängigkeit davon, wie lange sie am Leben ist.[CR] - Nachbarfärbung einer Zelle in Abhängigkeit von der Konstitution ihrer Nachbarn.[CR] - Viele Parameter sind in den Einstellungen konfigurierbar.
it_it: Un'implementazione del famoso "Game of Life" di John Conway con tre regole di colorazione personalizzate. Alcune regole di base determinano quali cellule vivranno nella prossima generazione a seconda dello stato attuale delle cellule e del numero dei suoi vicini vivi.[CR][CR]Le schermate non rendono così tanto giustizia quanto il movimento del sistema al confine tra la stabilità e il caos è ciò che sembra interessante.[CR][CR]Caratteristiche:[CR] - Vengono implementate tre regole di colorazione personalizzate ciascuna con risultati interessanti.[CR] - Colony colora le celle a seconda del colore delle sue celle "genitrici".[ CR] - Lifetime colora una cella in base a quanto tempo è stata in vita.[CR] - Neighbor colora una cella in base alla configurazione delle sue celle vicine.[CR] - Molti parametri sono configurabili nelle impostazioni.
zh_cn: 约翰·康威著名的“生活游戏”的一个实现，带有3个自定义着色规则。根据细胞的当前状态和其活的邻居的数量，一些基本规则决定了下一代细胞将存活。[CR][CR]截图没有做到这一点，因为系统在稳定和混乱之间的运动看起来很有趣。[CR][CR]特性:[CR] -实现了3个自定义着色规则，每个规则都产生了有趣的结果。[CR] -菌落根据其“亲代”细胞的颜色给细胞着色。[CR] -根据细胞存活的时间给细胞着色。[CR] -邻居根据其邻居的配置为单元格着色。[CR] -许多参数可在设置中配置。

# #30000
source: General
de_de: Allgemein
it_it: Generale
zh_cn: 常规

# #30001
source: Minimum grid size
de_de: Minimale Rastergröße
it_it: Dimensione minima griglia
zh_cn: 最小网格尺寸

# #30002
source: Maximum grid size
de_de: Maximale Rastergröße
it_it: Dimensione massima griglia
zh_cn: 最大网格尺寸

# #30003
source: Reset time
de_de: Zeit zurücksetzen
it_it: Tempo rispristino
zh_cn: 重置时间

# #30004
source: Preset change
de_de: Wechseln der Voreinstellung
it_it: Modifica preimpostata
zh_cn: 重置更改

# #30005
source: Minimum line size
de_de: Minimale Zeilengröße
it_it: Dimensione minima linea
zh_cn: 最小线尺寸

# #30006
source: Use colony colouring
de_de: Koloniefärbung verwenden
it_it: Usa colorazione Colony
zh_cn: 使用菌落着色

# #30007
source: Use lifetime colouring
de_de: Lebenszeitfärbung verwenden
it_it: Usa colorazione Lifetime
zh_cn: 使用终身着色

# #30008
source: Use neighbour colouring
de_de: Nachbarfärbung verwenden
it_it: Usa colorazione Neighbor
zh_cn: 使用相邻颜色
